Repository: FreekKalter/dwonload
Catalog: po/*.po
Languages: nl

source: New
nl: Nieuw

source: Files I shared
nl: Bestanden die ik heb gedeeld

source: Files shared with me
nl: Bestanden die met mij zijn gedeeld

source: Filename
nl: Bestandsnaam

source: Size
nl: Grootte

source: Owner
nl: Eigenaar

source: Comment:
nl: Beschrijving:

source: File to share:
nl: Bestand om te delen:

source: Post link on friends wall:
nl: Plaats link bij vrienden op wall:

source: Friends to share with:
nl: Vrienden om bestand mee te delen:

source: A simple filesharing solution for everyone!
nl: Een simpele manier om bestanden te delen.

source: Select at least 1 friend.
nl: Selecteer minstens 1 vriend.

source: Select a file to share.
nl: Selecteer een bestand om te delen.
